tests/massConservation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          GAMG;
        tolerance       1e-5;
        relTol          0;
        smoother        GaussSeidel;
    }
    cellDisplacementFinal
    {
        $cellDisplacement;
        tolerance      1e-6;
        relTol         0;
    }
    
    p
    {
        solver          GAMG;
        tolerance       1e-9;
        relTol          0.0001;
        maxIter         30;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance       1e-9;
        relTol          0;
    }

    pcorrFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    }

    Cs
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    3;
        alphaApplyPrevCorr  no;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }
    //	    solver          smoothSolver;
    //    smoother        symGaussSeidel;
     //   tolerance       1e-9;
    //    relTol          0;
   // }
    CsFinal
    {
        $Cs;
	    //solver          PBiCG;
        //preconditioner  DILU;
       // solver          smoothSolver;
        //smoother        symGaussSeidel;
        //tolerance       1e-9;
        //relTol          0;
    }

    "Cs.*Diffusion"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

}

PIMPLE
{
    momentumPredictor 0;
    nOuterCorrectors  1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    correctAlpha    0;
    nAlphaCorr      1;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
